---
layout : post
title: Redis命令大全
category : Redis
duoshuo: true
math: true
date : 2015-1-11
---

<!-- more -->

Redis是一个高性能的key-value内存数据库，官网：[http://redis.io/](http://redis.io/)。

##String相关操作
>
- set/get 赋值和取值：
- append：如果 key 已经存在，并且值为字符串，那么这个命令会把 value 追加到原来值（value）的结尾。 如果 key 不存在，那么它将首先创建一个空字符串的key，再执行追加操作。返回追加后的结果。
- decr：对key对应的数字做减1操作。这个操作最大支持在64位有符号的整型数字。返回减一后的值。
- decrby：将key对应的数字减去指定的值。返回减后的结果。
- setbit/getbit 对字符串指定offset处的bit进行赋值和取值。
- setrange/getrange setrange这个命令的作用是覆盖key对应的string的一部分，从指定的offset处开始，覆盖value的长度。 getrange在小于2.0的Redis版本中叫SUBSTR。 返回key对应的字符串value的子串，这个子串是由start和end位移决定的（两者都在string内）。可以用负的位移来表示从string尾部开始数的下标。所以-1就是最后一个字符，-2就是倒数第二个，以此类推。
{% highlight sql %}
redis> SET mykey "This is a string" 
OK
redis> GETRANGE mykey 0 3
"This"
redis> GETRANGE mykey -3 -1
"ing"
redis> GETRANGE mykey 0 -1
"This is a string"
redis> GETRANGE mykey 10 100
"string"
{% endhighlight %}
- getset 自动将key对应到value并且返回原来key对应的value。如果key存在但是对应的value不是字符串，就返回错误。
GETSET可以和INCR一起使用实现支持重置的计数功能。举个例子：每当有事件发生的时候，一段程序都会调用INCR给key mycounter加1，
但是有时我们需要获取计数器的值，并且自动将其重置为0。这可以通过GETSET mycounter "0"来实现：
{% highlight sql %}
redis> INCR mycounter
(integer) 1
redis> GETSET mycounter "0"
"1"
redis> GET mycounter
"0"
{% endhighlight %}
- incr 对key对应的数字做加1操作。
- incrby 对key对应的数字做加上指定的值。
- incrbyfloat 对key对应的数字做加上指定的浮点型值。
- mset/mget   对应给定的keys到他们相应的values上。  返回所有指定的key的value。
{% highlight sql %}
redis> MSET key1 "Hello" key2 "World"
OK
redis> GET key1
"Hello"
redis> GET key2
"World"
redis> SET key1 "Hello"
OK
redis> SET key2 "World"
OK
redis> MGET key1 key2 nonexisting
1) "Hello"
2) "World"
3) (nil)
{% endhighlight %}
- msetnx 对应给定的keys到他们相应的values上。只要有一个key已经存在，MSETNX一个操作都不会执行。 由于这种特性，MSETNX可以实现要么所有的操作都成功，要么一个都不执行，这样可以用来设置不同的key，来表示一个唯一的对象的不同字段。
{% highlight sql %}
redis> MSETNX key1 "Hello" key2 "there"
(integer) 1
redis> MSETNX key2 "there" key3 "world"
(integer) 0
redis> MGET key1 key2 key3
1) "Hello"
2) "there"
3) (nil)
{% endhighlight %}
- setex 设置key对应字符串value，并且设置key在给定的seconds时间之后超时过期。
- strlen 返回key的string类型value的长度。

##Hashs相关操作
>
- hset/hget 赋值和取值
{% highlight sql %}
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HGET myhash field1
"Hello"
{% endhighlight %}
- hdel 从 key 指定的哈希集中移除指定的域。
- hexists 指定key的哈希集中是否存在指定的字段。
- hgetall 返回 key 指定的哈希集中所有的字段和值。返回值中，每个字段名的下一个是它的值。
{% highlight sql %}
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HSET myhash field2 "World"
(integer) 1
redis> HGETALL myhash
1) "field1"
2) "Hello"
3) "field2"
4) "World"
{% endhighlight %}
- hincrby 增加 key 指定的哈希集中指定字段的数值。如果 key 不存在，会创建一个新的哈希集并与 key 关联。如果字段不存在，则字段的值在该操作执行前被设置为 0
{% highlight sql %}
redis> HSET myhash field 5
(integer) 1
redis> HINCRBY myhash field 1
(integer) 6
redis> HINCRBY myhash field -1
(integer) 5
redis> HINCRBY myhash field -10
(integer) -5
{% endhighlight %}
- hincrbyfloat 增加 key 指定的哈希集中指定字段的浮点型数值。
{% highlight sql %}
redis> HSET mykey field 10.50
(integer) 1
redis> HINCRBYFLOAT mykey field 0.1
"10.6"
redis> HSET mykey field 5.0e3
(integer) 0
redis> HINCRBYFLOAT mykey field 2.0e2
"5200"
{% endhighlight %}
- hkeys 返回 key 指定的哈希集中所有字段的名字。
{% highlight sql %}
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HSET myhash field2 "World"
(integer) 1
redis> HKEYS myhash
1) "field1"
2) "field2"
{% endhighlight %}
- hvals 返回 key 指定的哈希集中所有字段的值。
{% highlight sql %}
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HSET myhash field2 "World"
(integer) 1
redis> HVALS myhash
1) "Hello"
2) "World"
{% endhighlight %}
- hlen 返回 key 指定的哈希集包含的字段的数量。
- hmset/hmget 批量赋值和取值
{% highlight sql %}
redis> HMSET myhash field1 "Hello" field2 "World"
OK
redis> HMGET myhash field1 field2 nofield
1) "Hello"
2) "World"
3) (nil)
{% endhighlight %}
- hsetnx 只在 key 指定的哈希集中不存在指定的字段时，设置字段的值。如果 key 指定的哈希集不存在，会创建一个新的哈希集并与 key 关联。如果字段已存在，该操作无效果。
{% highlight sql %}
redis> HSETNX myhash field "Hello"
(integer) 1
redis> HSETNX myhash field "World"
(integer) 0
redis> HGET myhash field
"Hello"
{% endhighlight %}

##List相关操作
>
- lpush/ rpush 向存于 key 的列表的头部/尾部插入所有指定的值。如果 key 不存在，那么会创建一个空的列表然后再进行 push 操作。 当 key 保存的不是一个列表，那么会返回一个错误。
              可以使用一个命令把多个元素打入队列，只需要在命令后面指定多个参数。
- lpop/rpop 移除并且返回 key 对应的 list 的第一个/最后元素。
- lpushe/rpushe 只有当 key 已经存在并且存着一个 list 的时候，在这个 key 下面的 list 的头部/尾部插入 value。当 key 不存在的时候不会进行任何操作。

