---
layout : post
title: Redis命令大全(一)
category : Redis
duoshuo: true
math: true
date : 2015-1-11
---

<!-- more -->

Redis是一个高性能的key-value内存数据库，官网：[http://redis.io/](http://redis.io/)。

##String相关操作
>
- set/get 赋值和取值：
- append：如果 key 已经存在，并且值为字符串，那么这个命令会把 value 追加到原来值（value）的结尾。 如果 key 不存在，那么它将首先创建一个空字符串的key，再执行追加操作。返回追加后的结果。
- decr：对key对应的数字做减1操作。这个操作最大支持在64位有符号的整型数字。返回减一后的值。
- decrby：将key对应的数字减去指定的值。返回减后的结果。
- setbit/getbit 对字符串指定offset处的bit进行赋值和取值。
- setrange/getrange setrange这个命令的作用是覆盖key对应的string的一部分，从指定的offset处开始，覆盖value的长度。 getrange在小于2.0的Redis版本中叫SUBSTR。 返回key对应的字符串value的子串，这个子串是由start和end位移决定的（两者都在string内）。可以用负的位移来表示从string尾部开始数的下标。所以-1就是最后一个字符，-2就是倒数第二个，以此类推。
{% highlight sql %}
redis> SET mykey "This is a string" 
OK
redis> GETRANGE mykey 0 3
"This"
redis> GETRANGE mykey -3 -1
"ing"
redis> GETRANGE mykey 0 -1
"This is a string"
redis> GETRANGE mykey 10 100
"string"
{% endhighlight %}
- getset 自动将key对应到value并且返回原来key对应的value。如果key存在但是对应的value不是字符串，就返回错误。
GETSET可以和INCR一起使用实现支持重置的计数功能。举个例子：每当有事件发生的时候，一段程序都会调用INCR给key mycounter加1，
但是有时我们需要获取计数器的值，并且自动将其重置为0。这可以通过GETSET mycounter "0"来实现：
{% highlight sql %}
redis> INCR mycounter
(integer) 1
redis> GETSET mycounter "0"
"1"
redis> GET mycounter
"0"
{% endhighlight %}
- incr 对key对应的数字做加1操作。
- incrby 对key对应的数字做加上指定的值。
- incrbyfloat 对key对应的数字做加上指定的浮点型值。
- mset/mget   对应给定的keys到他们相应的values上。  返回所有指定的key的value。
{% highlight sql %}
redis> MSET key1 "Hello" key2 "World"
OK
redis> GET key1
"Hello"
redis> GET key2
"World"
redis> SET key1 "Hello"
OK
redis> SET key2 "World"
OK
redis> MGET key1 key2 nonexisting
1) "Hello"
2) "World"
3) (nil)
{% endhighlight %}
- msetnx 对应给定的keys到他们相应的values上。只要有一个key已经存在，MSETNX一个操作都不会执行。 由于这种特性，MSETNX可以实现要么所有的操作都成功，要么一个都不执行，这样可以用来设置不同的key，来表示一个唯一的对象的不同字段。
{% highlight sql %}
redis> MSETNX key1 "Hello" key2 "there"
(integer) 1
redis> MSETNX key2 "there" key3 "world"
(integer) 0
redis> MGET key1 key2 key3
1) "Hello"
2) "there"
3) (nil)
{% endhighlight %}
- setex 设置key对应字符串value，并且设置key在给定的seconds时间之后超时过期。
- strlen 返回key的string类型value的长度。

##Hashs相关操作
>
- hset/hget 赋值和取值
{% highlight sql %}
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HGET myhash field1
"Hello"
{% endhighlight %}
- hdel 从 key 指定的哈希集中移除指定的域。
- hexists 指定key的哈希集中是否存在指定的字段。
- hgetall 返回 key 指定的哈希集中所有的字段和值。返回值中，每个字段名的下一个是它的值。
{% highlight sql %}
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HSET myhash field2 "World"
(integer) 1
redis> HGETALL myhash
1) "field1"
2) "Hello"
3) "field2"
4) "World"
{% endhighlight %}
- hincrby 增加 key 指定的哈希集中指定字段的数值。如果 key 不存在，会创建一个新的哈希集并与 key 关联。如果字段不存在，则字段的值在该操作执行前被设置为 0
{% highlight sql %}
redis> HSET myhash field 5
(integer) 1
redis> HINCRBY myhash field 1
(integer) 6
redis> HINCRBY myhash field -1
(integer) 5
redis> HINCRBY myhash field -10
(integer) -5
{% endhighlight %}
- hincrbyfloat 增加 key 指定的哈希集中指定字段的浮点型数值。
{% highlight sql %}
redis> HSET mykey field 10.50
(integer) 1
redis> HINCRBYFLOAT mykey field 0.1
"10.6"
redis> HSET mykey field 5.0e3
(integer) 0
redis> HINCRBYFLOAT mykey field 2.0e2
"5200"
{% endhighlight %}
- hkeys 返回 key 指定的哈希集中所有字段的名字。
{% highlight sql %}
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HSET myhash field2 "World"
(integer) 1
redis> HKEYS myhash
1) "field1"
2) "field2"
{% endhighlight %}
- hvals 返回 key 指定的哈希集中所有字段的值。
{% highlight sql %}
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HSET myhash field2 "World"
(integer) 1
redis> HVALS myhash
1) "Hello"
2) "World"
{% endhighlight %}
- hlen 返回 key 指定的哈希集包含的字段的数量。
- hmset/hmget 批量赋值和取值
{% highlight sql %}
redis> HMSET myhash field1 "Hello" field2 "World"
OK
redis> HMGET myhash field1 field2 nofield
1) "Hello"
2) "World"
3) (nil)
{% endhighlight %}
- hsetnx 只在 key 指定的哈希集中不存在指定的字段时，设置字段的值。如果 key 指定的哈希集不存在，会创建一个新的哈希集并与 key 关联。如果字段已存在，该操作无效果。
{% highlight sql %}
redis> HSETNX myhash field "Hello"
(integer) 1
redis> HSETNX myhash field "World"
(integer) 0
redis> HGET myhash field
"Hello"
{% endhighlight %}

##List相关操作
>
- lpush/ rpush 向存于 key 的列表的头部/尾部插入所有指定的值。如果 key 不存在，那么会创建一个空的列表然后再进行 push 操作。 当 key 保存的不是一个列表，那么会返回一个错误。
              可以使用一个命令把多个元素打入队列，只需要在命令后面指定多个参数。
- lpop/rpop 移除并且返回 key 对应的 list 的第一个/最后元素。
- lpushe/rpushe 只有当 key 已经存在并且存着一个 list 的时候，在这个 key 下面的 list 的头部/尾部插入 value。当 key 不存在的时候不会进行任何操作。
- blpop/brpop  lpop/rpop的阻塞版本。
- rpoplpush rpoplpush source destination 原子性地返回并移除存储在 source 的列表的最后一个元素（列表尾部元素）， 并把该元素放入存储在 destination 的列表的第一个元素位置（列表头部）。
{% highlight sql %}
redis> RPUSH mylist "one"
(integer) 1
redis> RPUSH mylist "two"
(integer) 2
redis> RPUSH mylist "three"
(integer) 3
redis> RPOPLPUSH mylist myotherlist
"three"
redis> LRANGE mylist 0 -1
1) "one"
2) "two"
redis> LRANGE myotherlist 0 -1
1) "three"
{% endhighlight %}
- brpoplpush rpoplpush的阻塞版本。
- lindex lindex key index 返回指定key的指定位置的值。
- linsert linsert key before/after pivot value 把 value 插入存于 key 的列表中在基准值 pivot 的前面或后面。
{% highlight sql %}
redis> RPUSH mylist "Hello"
(integer) 1
redis> RPUSH mylist "World"
(integer) 2
redis> LINSERT mylist BEFORE "World" "There"
(integer) 3
redis> LRANGE mylist 0 -1
1) "Hello"
2) "There"
3) "World"
{% endhighlight %}
- lrange lrange key start stop 返回存储在 key 的列表里指定范围内的元素。
{% highlight sql %}
redis> RPUSH mylist "one"
(integer) 1
redis> RPUSH mylist "two"
(integer) 2
redis> RPUSH mylist "three"
(integer) 3
redis> LRANGE mylist 0 0
1) "one"
redis> LRANGE mylist -3 2
1) "one"
2) "two"
3) "three"
redis> LRANGE mylist -100 100
1) "one"
2) "two"
3) "three"
redis> LRANGE mylist 5 10
(empty list or set)
{% endhighlight %}
- lrem lrem key count value 从存于 key 的列表里移除前 count 次出现的值为 value 的元素。
{% highlight sql %}
redis> RPUSH mylist "hello"
(integer) 1
redis> RPUSH mylist "hello"
(integer) 2
redis> RPUSH mylist "foo"
(integer) 3
redis> RPUSH mylist "hello"
(integer) 4
redis> LREM mylist -2 "hello"
(integer) 2
redis> LRANGE mylist 0 -1
1) "hello"
2) "foo"
{% endhighlight %}
- ltrim ltrim key start stop 修剪(trim)一个已存在的 list，这样 list 就会只包含指定范围的指定元素。
{% highlight sql %}
redis> RPUSH mylist "one"
(integer) 1
redis> RPUSH mylist "two"
(integer) 2
redis> RPUSH mylist "three"
(integer) 3
redis> LTRIM mylist 1 -1
OK
redis> LRANGE mylist 0 -1
1) "two"
2) "three"
{% endhighlight %}

##Set相关操作
>
- sadd :sadd key member [member ...] 添加一个或多个指定的member元素到集合的 key中.指定的一个或者多个元素member 如果已经在集合key中存在则忽略.
{% highlight sql %}
redis> SADD myset "Hello"
(integer) 1
redis> SADD myset "World"
(integer) 1
redis> SADD myset "World"
(integer) 0
redis> SMEMBERS myset
1) "World"
2) "Hello"
{% endhighlight %}
- scard:scard key 返回集合的大小
- sdiff:SDIFF key [key ...] 返回一个集合与给定集合的差集的元素.
{% highlight sql %}
redis> SADD key1 "a"
(integer) 1
redis> SADD key1 "b"
(integer) 1
redis> SADD key1 "c"
(integer) 1
redis> SADD key2 "c"
(integer) 1
redis> SADD key2 "d"
(integer) 1
redis> SADD key2 "e"
(integer) 1
redis> SDIFF key1 key2
1) "a"
2) "b"
{% endhighlight %}
- sdiff: SDIFFSTORE destination key [key ...] 该命令类似于 SDIFF, 不同之处在于该命令不返回结果集，而是将结果存放在destination集合中.
- sinter:SINTER key [key ...] 返回指定所有的集合的成员的交集.
{% highlight sql %}
redis> SADD key1 "a"
(integer) 1
redis> SADD key1 "b"
(integer) 1
redis> SADD key1 "c"
(integer) 1
redis> SADD key2 "c"
(integer) 1
redis> SADD key2 "d"
(integer) 1
redis> SADD key2 "e"
(integer) 1
redis> SINTER key1 key2
1) "c"
{% endhighlight %}
- sinterstore SINTERSTORE destination key [key ...] 这个命令与SINTER命令类似, 但是它并不是直接返回结果集,而是将结果保存在 destination集合中.
- sismember SISMEMBER key member 返回成员 member 是否是存储的集合 key的成员.
- smembers SMEMBERS key 返回key集合所有的元素.
- smove SMOVE source destination member 将member从source集合移动到destination集合中.
{% highlight sql %}
redis> SADD myset "one"
(integer) 1
redis> SADD myset "two"
(integer) 1
redis> SADD myotherset "three"
(integer) 1
redis> SMOVE myset myotherset "two"
(integer) 1
redis> SMEMBERS myset
1) "one"
redis> SMEMBERS myotherset
1) "three"
2) "two"
{% endhighlight %}
- spop SPOP key 移除并返回一个集合中的随机元素
- sranmember SRANDMEMBER key [count] 仅提供key参数,那么随机返回key集合中的一个元素.
  Redis 2.6开始, 可以接受 count 参数,如果count是整数且小于元素的个数，
  返回含有 count 个不同的元素的数组,如果count是个整数且大于集合中元素的个数时,仅返回整个集合的所有元素,
  当count是负数,则会返回一个包含count的绝对值的个数元素的数组，如果count的绝对值大于元素的个数,则返回的结果集里会出现一个元素出现多次的情况.
- srem SREM key member [member ...] 在key集合中移除指定的元素.
- sunion SUNION key [key ...] 返回给定的多个集合的并集中的所有成员.
- sunionstore 该命令作用类似于SUNION命令,不同的是它并不返回结果集,而是将结果存储在destination集合中.

##Sorted Set
>
- zadd ZADD key score member [score member ...] 该命令添加指定的成员到key对应的有序集合中，每个成员都有一个分数。
- zcard 返回key的有序集元素个数。
- zount ZCOUNT key min max 返回有序集key中，score值在min和max之间(默认包括score值等于min或max)的成员。
- zincrby ZINCRBY key increment member 为有序集key的成员member的score值加上增量increment。
- zrem ZREM key member [member ...] 删除一个或多个成员
- zrank ZRANK key member 返回有序集key中成员member的排名(分数从小到大排列)。 
- zremrangebyscore ZREMRANGEBYSCORE key min max 移除有序集key中，所有score值介于min和max之间(包括等于min或max)的成员。
- zinterstore ZINTERSTORE destination numkeys key [key ...] 计算给定的numkeys个有序集合的交集，并且把结果放到destination中。
{% highlight sql %}
redis> ZADD zset1 1 "one"
(integer) 1
redis> ZADD zset1 2 "two"
(integer) 1
redis> ZADD zset2 1 "one"
(integer) 1
redis> ZADD zset2 2 "two"
(integer) 1
redis> ZADD zset2 3 "three"
(integer) 1
redis> ZINTERSTORE out 2 zset1 zset2
(integer) 2
redis> ZRANGE out 0 -1
1)"one"
2)"two"
{% endhighlight %}
- zrange ZRANGE key start stop 返回有序集key中，指定区间内的成员。其中成员按score值递增(从小到大)来排序。具有相同score值的成员按字典序来排列。
- zrangebyscore ZRANGEBYSCORE key min max 返回key的有序集合中的分数在min和max之间的所有元素（包括分数等于max或者min的元素）。min和max可以是-inf和+inf，这样一来，你就可以在不知道有序集的最低和最高score值的情况下，使用ZRANGEBYSCORE这类命令。
- zremrangebyrank ZREMRANGEBYRANK key start stop 移除有序集key中，指定排名(rank)区间内的所有成员。
- zrevrange ZREVRANGE key start stop 返回有序集key中，指定区间内的成员。其中成员的位置按score值递减(从大到小)来排列。具有相同score值的成员按字典序的反序排列。
- zrevrangebyscore 返回key的有序集合中的分数在max和min之间的所有元素（包括分数等于max或者min的元素）。与有序集合的默认排序相反，对于这个命令，元素被认为是从高分到低具有相同分数的元素按字典反序。
- zrevrank 返回有序集key中成员member的排名，其中有序集成员按score值从大到小排列。排名以0为底，也就是说，score值最大的成员排名为0。
- zscore ZSCORE key member 返回有序集key中，成员member的score值。

